site_list=["北京","上海","广东"]
'''黑龙江（哈尔滨）、吉林（长春）、辽宁（沈阳）、内蒙古自治区（呼和浩特）、北京（北京）、天津（天津）、河北（石家庄）、山东（济南）、山西（太原）、陕西（西安）、甘肃（兰州）、新疆维吾尔自治区（乌鲁木齐）、青海（西宁）、西藏自治区（拉萨）、四川（成都）
河南（郑州）、江苏（南京）、安徽（合肥）、湖北（武汉）、重庆（重庆）、贵州（贵阳）、湖南（长沙）、江西（南昌）、上海（上海）、浙江（杭州）、福建（福州）、云南（昆明）、广西壮族自治区（南宁）、广东（广州）、海南（海口）、香港特别行政区（香港）、澳门特别行政区（澳门）、台湾（台北）。'''
list2=["哈尔滨","长春","沈阳","呼和浩特","天津","石家庄","济南","太原","西安","兰州","乌鲁木齐","西宁","拉萨","成都","郑州","南京","合肥","武汉","重庆","贵阳","长沙","南昌","杭州","福州","昆明","南宁","海口","香港","澳门","台北"]
#
site_list.extend(list2)
#
site_list.remove("上海")
site_list.insert(2,"上海")
#
GDP_list=[36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]
gdp_sum=0
for i in GDP_list:
    gdp_sum+=i
print(round(gdp_sum,3),round(gdp_sum/8,3))
#
a = [1,5,21,30,15,9,30,24]
sum =0
for i in a:
    if i%5==0:
       sum+=i
###
lisr = [1,2,3,4,5,6,7,8,9]
lisr.reverse()
print(lisr)


##
lis = [1,4,7,5,8,2,1,3,4,5,9,7,6,1,10]
lis2=[]
for i in lis:
    if i not in lis2:
        lis2.append(i)
for i in range(len(lis2)):
    sum = 0
    for x in lis:
        if x==lis2[i]:
            sum+=1
    print("{0}出现了{1}次".format(lis2[i],sum))
